In [1]:
#import libraries

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
#import dataframe

In [4]:
df= df = pd.DataFrame({  'card': ['1971 Topps Nolan Ryan', '1928 Ogden Don Bradman', '1909 T206 Ty Cobb', '1887 Lone Jack Ben Franklin', '2005 Topps Justin Verlander'] })
df

                          card
0        1971 Topps Nolan Ryan
1       1928 Ogden Don Bradman
2            1909 T206 Ty Cobb
3  1887 Lone Jack Ben Franklin
4  2005 Topps Justin Verlander

In [5]:
df.head(5)

                          card
0        1971 Topps Nolan Ryan
1       1928 Ogden Don Bradman
2            1909 T206 Ty Cobb
3  1887 Lone Jack Ben Franklin
4  2005 Topps Justin Verlander

In [6]:
df.dtypes

card    object
dtype: object

In [7]:
#Generic string split

In [8]:
df['card'].str.split(' ')

0           [1971, Topps, Nolan, Ryan]
1          [1928, Ogden, Don, Bradman]
2               [1909, T206, Ty, Cobb]
3    [1887, Lone, Jack, Ben, Franklin]
4     [2005, Topps, Justin, Verlander]
Name: card, dtype: object

In [9]:
df['card'].str.split(' ',expand=True)

      0      1       2          3         4
0  1971  Topps   Nolan       Ryan      None
1  1928  Ogden     Don    Bradman      None
2  1909   T206      Ty       Cobb      None
3  1887   Lone    Jack        Ben  Franklin
4  2005  Topps  Justin  Verlander      None

In [10]:
#String Split Using N = 1

In [11]:
#split df so year is in its own column

In [12]:
df['card'].str.split(' ',n=1 ,expand=True)

      0                       1
0  1971        Topps Nolan Ryan
1  1928       Ogden Don Bradman
2  1909            T206 Ty Cobb
3  1887  Lone Jack Ben Franklin
4  2005  Topps Justin Verlander

In [13]:
df['card'].str.split(' ',n=2 ,expand=True).rename(columns={0:'year', 1:'brand',2:'subject'})

   year  brand            subject
0  1971  Topps         Nolan Ryan
1  1928  Ogden        Don Bradman
2  1909   T206            Ty Cobb
3  1887   Lone  Jack Ben Franklin
4  2005  Topps   Justin Verlander

In [14]:
#new columns

In [15]:
df.head(5)

                          card
0        1971 Topps Nolan Ryan
1       1928 Ogden Don Bradman
2            1909 T206 Ty Cobb
3  1887 Lone Jack Ben Franklin
4  2005 Topps Justin Verlander

In [16]:
df[['year','brand','subject']]= df['card'].str.split(' ',n=2 ,expand=True)
df

                          card  year  brand            subject
0        1971 Topps Nolan Ryan  1971  Topps         Nolan Ryan
1       1928 Ogden Don Bradman  1928  Ogden        Don Bradman
2            1909 T206 Ty Cobb  1909   T206            Ty Cobb
3  1887 Lone Jack Ben Franklin  1887   Lone  Jack Ben Franklin
4  2005 Topps Justin Verlander  2005  Topps   Justin Verlander

In [17]:
# drop old column

In [19]:
df.drop(columns=['card'])

   year  brand            subject
0  1971  Topps         Nolan Ryan
1  1928  Ogden        Don Bradman
2  1909   T206            Ty Cobb
3  1887   Lone  Jack Ben Franklin
4  2005  Topps   Justin Verlander

In [18]:
df2 = df.drop(columns=['card'])
df2

   year  brand            subject
0  1971  Topps         Nolan Ryan
1  1928  Ogden        Don Bradman
2  1909   T206            Ty Cobb
3  1887   Lone  Jack Ben Franklin
4  2005  Topps   Justin Verlander

In [23]:
#Example Interview Style Question
#Baseball Slashline --> AVG/OBP/SLG .300/.400./.500
#Show each in new columns, you can keep Slashline

In [24]:
#import dataframe

In [26]:
df3 = pd.DataFrame({
                    'Player':['Mike Trout', 'Mookie Betts', 'Ted Williams', 'Stan Musial', 'Tris Speaker'],
                    'Slashline': ['.301/.412/.582','.291/.369/.522','.344/.482/.634','.331/.417/.559','.345/.428/.500']
})

df3

         Player       Slashline
0    Mike Trout  .301/.412/.582
1  Mookie Betts  .291/.369/.522
2  Ted Williams  .344/.482/.634
3   Stan Musial  .331/.417/.559
4  Tris Speaker  .345/.428/.500

In [27]:
#split columns

In [28]:
df3['Slashline'].str.split('/',n=2, expand = True)

      0     1     2
0  .301  .412  .582
1  .291  .369  .522
2  .344  .482  .634
3  .331  .417  .559
4  .345  .428  .500

In [29]:
df3[['AVG','OBP','SLG']]= df3['Slashline'].str.split('/',n=2, expand = True)
df3

         Player       Slashline   AVG   OBP   SLG
0    Mike Trout  .301/.412/.582  .301  .412  .582
1  Mookie Betts  .291/.369/.522  .291  .369  .522
2  Ted Williams  .344/.482/.634  .344  .482  .634
3   Stan Musial  .331/.417/.559  .331  .417  .559
4  Tris Speaker  .345/.428/.500  .345  .428  .500

In [30]:
df3.sort_values('OBP', ascending = False)

         Player       Slashline   AVG   OBP   SLG
2  Ted Williams  .344/.482/.634  .344  .482  .634
4  Tris Speaker  .345/.428/.500  .345  .428  .500
3   Stan Musial  .331/.417/.559  .331  .417  .559
0    Mike Trout  .301/.412/.582  .301  .412  .582
1  Mookie Betts  .291/.369/.522  .291  .369  .522

In [31]:
df3.sort_values('SLG', ascending = False)

         Player       Slashline   AVG   OBP   SLG
2  Ted Williams  .344/.482/.634  .344  .482  .634
0    Mike Trout  .301/.412/.582  .301  .412  .582
3   Stan Musial  .331/.417/.559  .331  .417  .559
1  Mookie Betts  .291/.369/.522  .291  .369  .522
4  Tris Speaker  .345/.428/.500  .345  .428  .500